logs/fio-diskseq/slurm/002/log005.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;89081;347;94168;0;0;0.000000;0.000000;90;115004;2861.581893;5564.632422;1.000000%=96;5.000000%=97;10.000000%=98;20.000000%=109;30.000000%=113;40.000000%=115;50.000000%=126;60.000000%=175;70.000000%=205;80.000000%=7700;90.000000%=11599;95.000000%=13828;99.000000%=22151;99.500000%=27918;99.900000%=39583;99.950000%=43778;99.990000%=50069;0%=0;0%=0;0%=0;93;115007;2865.405534;5564.442813;8704;1160192;100.000000%;89175.148936;126718.140398;0.106194%;5.226884%;7872;0;220;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;14.54%;61.49%;0.19%;0.00%;0.00%;0.59%;0.05%;10.73%;11.09%;1.32%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;69;1054;0;0;5050;107839;112889;62.80%;slaves;68;29057;1;19;4978;330418;336133;98.97%;sda;68;29057;1;19;4978;330418;336133;98.97%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=66767: Fri Dec  1 17:43:41 2023
  write: IOPS=347, BW=87.0MiB/s (91.2MB/s)(8192MiB/94168msec); 0 zone resets
    clat (usec): min=90, max=115004, avg=2861.58, stdev=5564.63
     lat (usec): min=93, max=115007, avg=2865.41, stdev=5564.44
    clat percentiles (usec):
     |  1.00th=[   97],  5.00th=[   98], 10.00th=[   99], 20.00th=[  110],
     | 30.00th=[  114], 40.00th=[  116], 50.00th=[  127], 60.00th=[  176],
     | 70.00th=[  206], 80.00th=[ 7701], 90.00th=[11600], 95.00th=[13829],
     | 99.00th=[22152], 99.50th=[27919], 99.90th=[39584], 99.95th=[43779],
     | 99.99th=[50070]
   bw (  KiB/s): min= 8704, max=1160192, per=100.00%, avg=89175.15, stdev=126718.14, samples=188
   iops        : min=   34, max= 4532, avg=348.34, stdev=494.99, samples=188
  lat (usec)   : 100=14.54%, 250=61.49%, 500=0.19%
  lat (msec)   : 2=0.59%, 4=0.05%, 10=10.73%, 20=11.09%, 50=1.32%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.11%, sys=5.23%, ctx=7872, majf=0, minf=220
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=87.0MiB/s (91.2MB/s), 87.0MiB/s-87.0MiB/s (91.2MB/s-91.2MB/s), io=8192MiB (8590MB), run=94168-94168msec

Disk stats (read/write):
    dm-0: ios=69/1054, merge=0/0, ticks=5050/107839, in_queue=112889, util=62.80%, aggrios=68/29057, aggrmerge=1/19, aggrticks=4978/330418, aggrin_queue=336133, aggrutil=98.97%
  sda: ios=68/29057, merge=1/19, ticks=4978/330418, in_queue=336133, util=98.97%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;447153;1746;18760;0;0;0.000000;0.000000;23;161778;571.302429;3254.392476;1.000000%=26;5.000000%=30;10.000000%=34;20.000000%=37;30.000000%=38;40.000000%=38;50.000000%=39;60.000000%=39;70.000000%=43;80.000000%=45;90.000000%=61;95.000000%=74;99.000000%=16056;99.500000%=16187;99.900000%=17956;99.950000%=20316;99.990000%=101187;0%=0;0%=0;0%=0;23;161778;571.362628;3254.391291;96256;491520;99.907807%;446740.756757;84348.587426;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.245216%;13.012421%;2818;0;74;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;83.26%;12.09%;0.01%;0.01%;0.01%;0.02%;0.77%;0.61%;0.52%;2.65%;0.02%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1581;44;0;0;51550;19648;71198;92.06%;slaves;33058;1007;20;0;847987;21672;869673;99.50%;sda;33058;1007;20;0;847987;21672;869673;99.50%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=67174: Fri Dec  1 17:44:00 2023
  read: IOPS=1746, BW=437MiB/s (458MB/s)(8192MiB/18760msec)
    clat (usec): min=23, max=161778, avg=571.30, stdev=3254.39
     lat (usec): min=23, max=161778, avg=571.36, stdev=3254.39
    clat percentiles (usec):
     |  1.00th=[    27],  5.00th=[    31], 10.00th=[    35], 20.00th=[    38],
     | 30.00th=[    39], 40.00th=[    39], 50.00th=[    40], 60.00th=[    40],
     | 70.00th=[    44], 80.00th=[    46], 90.00th=[    62], 95.00th=[    75],
     | 99.00th=[ 16057], 99.50th=[ 16188], 99.90th=[ 17957], 99.95th=[ 20317],
     | 99.99th=[101188]
   bw (  KiB/s): min=96256, max=491520, per=99.91%, avg=446740.76, stdev=84348.59, samples=37
   iops        : min=  376, max= 1920, avg=1745.08, stdev=329.49, samples=37
  lat (usec)   : 50=83.26%, 100=12.09%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.77%, 4=0.61%, 10=0.52%, 20=2.65%, 50=0.02%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.25%, sys=13.01%, ctx=2818, majf=0, minf=74
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=437MiB/s (458MB/s), 437MiB/s-437MiB/s (458MB/s-458MB/s), io=8192MiB (8590MB), run=18760-18760msec

Disk stats (read/write):
    dm-0: ios=1581/44, merge=0/0, ticks=51550/19648, in_queue=71198, util=92.06%, aggrios=33058/1007, aggrmerge=20/0, aggrticks=847987/21672, aggrin_queue=869673, aggrutil=99.50%
  sda: ios=33058/1007, merge=20/0, ticks=847987/21672, in_queue=869673, util=99.50%