logs/fio-diskseq/slurm/002/log007.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;86865;339;96570;0;0;0.000000;0.000000;90;127990;2934.275987;5799.471201;1.000000%=97;5.000000%=99;10.000000%=108;20.000000%=112;30.000000%=113;40.000000%=115;50.000000%=130;60.000000%=175;70.000000%=203;80.000000%=8585;90.000000%=10682;95.000000%=13041;99.000000%=22675;99.500000%=31850;99.900000%=39583;99.950000%=43778;99.990000%=128450;0%=0;0%=0;0%=0;93;127997;2938.086592;5799.257590;4608;1176576;100.000000%;86907.357513;120116.213503;0.179147%;5.010925%;8797;0;218;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;5.51%;69.29%;0.11%;0.00%;0.00%;0.60%;0.13%;12.84%;10.39%;1.10%;0.01%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;52;1121;0;0;3623;109597;113220;66.72%;slaves;48;29501;4;24;3340;342198;346017;99.03%;sda;48;29501;4;24;3340;342198;346017;99.03%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=68023: Fri Dec  1 17:47:55 2023
  write: IOPS=339, BW=84.8MiB/s (88.9MB/s)(8192MiB/96570msec); 0 zone resets
    clat (usec): min=90, max=127990, avg=2934.28, stdev=5799.47
     lat (usec): min=93, max=127997, avg=2938.09, stdev=5799.26
    clat percentiles (usec):
     |  1.00th=[    98],  5.00th=[   100], 10.00th=[   109], 20.00th=[   113],
     | 30.00th=[   114], 40.00th=[   116], 50.00th=[   131], 60.00th=[   176],
     | 70.00th=[   204], 80.00th=[  8586], 90.00th=[ 10683], 95.00th=[ 13042],
     | 99.00th=[ 22676], 99.50th=[ 31851], 99.90th=[ 39584], 99.95th=[ 43779],
     | 99.99th=[128451]
   bw (  KiB/s): min= 4608, max=1176576, per=100.00%, avg=86907.36, stdev=120116.21, samples=193
   iops        : min=   18, max= 4596, avg=339.48, stdev=469.20, samples=193
  lat (usec)   : 100=5.51%, 250=69.29%, 500=0.11%
  lat (msec)   : 2=0.60%, 4=0.13%, 10=12.84%, 20=10.39%, 50=1.10%
  lat (msec)   : 100=0.01%, 250=0.02%
  cpu          : usr=0.18%, sys=5.01%, ctx=8797, majf=0, minf=218
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=84.8MiB/s (88.9MB/s), 84.8MiB/s-84.8MiB/s (88.9MB/s-88.9MB/s), io=8192MiB (8590MB), run=96570-96570msec

Disk stats (read/write):
    dm-0: ios=52/1121, merge=0/0, ticks=3623/109597, in_queue=113220, util=66.72%, aggrios=48/29501, aggrmerge=4/24, aggrticks=3340/342198, aggrin_queue=346017, aggrutil=99.03%
  sda: ios=48/29501, merge=4/24, ticks=3340/342198, in_queue=346017, util=99.03%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;294719;1151;28463;0;0;0.000000;0.000000;23;195497;867.606255;6342.257492;1.000000%=25;5.000000%=27;10.000000%=29;20.000000%=32;30.000000%=35;40.000000%=38;50.000000%=42;60.000000%=44;70.000000%=45;80.000000%=46;90.000000%=62;95.000000%=76;99.000000%=16056;99.500000%=45875;99.900000%=91750;99.950000%=110624;99.990000%=137363;0%=0;0%=0;0%=0;23;195497;867.668103;6342.255854;107008;491520;100.000000%;296923.428571;154653.738673;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.189727%;9.061204%;2843;0;212;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;82.86%;12.55%;0.01%;0.02%;0.01%;0.01%;0.63%;0.63%;0.53%;2.21%;0.07%;0.39%;0.07%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1563;59;0;0;76713;30840;107553;93.51%;slaves;32999;1231;24;2;1438203;50522;1488785;96.10%;sda;32999;1231;24;2;1438203;50522;1488785;96.10%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=68442: Fri Dec  1 17:48:24 2023
  read: IOPS=1151, BW=288MiB/s (302MB/s)(8192MiB/28463msec)
    clat (usec): min=23, max=195497, avg=867.61, stdev=6342.26
     lat (usec): min=23, max=195497, avg=867.67, stdev=6342.26
    clat percentiles (usec):
     |  1.00th=[    26],  5.00th=[    28], 10.00th=[    30], 20.00th=[    33],
     | 30.00th=[    36], 40.00th=[    39], 50.00th=[    43], 60.00th=[    45],
     | 70.00th=[    46], 80.00th=[    47], 90.00th=[    63], 95.00th=[    77],
     | 99.00th=[ 16057], 99.50th=[ 45876], 99.90th=[ 91751], 99.95th=[110625],
     | 99.99th=[137364]
   bw (  KiB/s): min=107008, max=491520, per=100.00%, avg=296923.43, stdev=154653.74, samples=56
   iops        : min=  418, max= 1920, avg=1159.86, stdev=604.12, samples=56
  lat (usec)   : 50=82.86%, 100=12.55%, 250=0.01%, 500=0.02%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.63%, 4=0.63%, 10=0.53%, 20=2.21%, 50=0.07%
  lat (msec)   : 100=0.39%, 250=0.07%
  cpu          : usr=0.19%, sys=9.06%, ctx=2843, majf=0, minf=212
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=288MiB/s (302MB/s), 288MiB/s-288MiB/s (302MB/s-302MB/s), io=8192MiB (8590MB), run=28463-28463msec

Disk stats (read/write):
    dm-0: ios=1563/59, merge=0/0, ticks=76713/30840, in_queue=107553, util=93.51%, aggrios=32999/1231, aggrmerge=24/2, aggrticks=1438203/50522, aggrin_queue=1488785, aggrutil=96.10%
  sda: ios=32999/1231, merge=24/2, ticks=1438203/50522, in_queue=1488785, util=96.10%